## More Advanced Pandas

In [1]:
# Load the Pandas package for use in this notebook
import pandas as pd

### Data Normalisation

We may often want to scale numeric values in a Data Frame to conform to minimum and maximum values.

In [2]:
df = pd.DataFrame({"home":[0,3,2,4,2,1],"away":[0,1,0,2,0,0]})
df

   away  home
0     0     0
1     1     3
2     0     2
3     2     4
4     0     2
5     0     1

We can apply simple arithmetic operations to scale numeric Data Frames:

In [3]:
df / 10

   away  home
0   0.0   0.0
1   0.1   0.3
2   0.0   0.2
3   0.2   0.4
4   0.0   0.2
5   0.0   0.1

This allows us to easily normalise our data in different ways. For instance, we can subtract the mean column values from each row in the data frame:

In [4]:
df - df.mean()

   away  home
0  -0.5  -2.0
1   0.5   1.0
2  -0.5   0.0
3   1.5   2.0
4  -0.5   0.0
5  -0.5  -1.0

We could also divide each row by maximum value for each column

In [5]:
ndf = df - df.max()
ndf

   away  home
0    -2    -4
1    -1    -1
2    -2    -2
3     0     0
4    -2    -2
5    -2    -3

If we have made any modifications to a Data Frame, we can export the data as a new CSV file using the *to_csv()* function.

In [6]:
ndf.to_csv("modified_test.csv")

### Aggregating Data

Let's try a simple example of aggregating data stored in a Data Frame. This aggregation is based on a categorical value in each row.

In [7]:
df = pd.DataFrame({"Name":["E. Kenny","M. Martin","L. Varadkar","N. Collins","J. Burton"], 
                   "Party":["Fine Gael","Fianna Fail","Fine Gael", "Fianna Fail", "Labour"],
                   "Tweets": [ 399, 938, 1830, 1946, 907 ]})
df

          Name        Party  Tweets
0     E. Kenny    Fine Gael     399
1    M. Martin  Fianna Fail     938
2  L. Varadkar    Fine Gael    1830
3   N. Collins  Fianna Fail    1946
4    J. Burton       Labour     907

We will group the rows (i.e. the politicians) using the "Party" columns

In [8]:
groups = df.groupby("Party")


We can now apply the *sum()* function to get the total sum of tweets for each party:

In [9]:
groups.sum()

             Tweets
Party
Fianna Fail    2884
Fine Gael      2229
Labour          907

We can also get the mean number of tweets for each party:

In [ ]:
groups.mean()

As a second example, we load dataset of top Premier League goal scorers from the CSV file provided. We will use the player name as the index columns

In [ ]:
df = pd.read_csv("../data/goal_scorers.csv",index_col="Player")
df

Let's group the players based on the team that they play for (i.e the column with index "Team"):

In [ ]:
groups = df.groupby("Team")

We can now sum over the values for each team to get the total for each column:

In [ ]:
groups.sum()

We could also have calculated the mean goals per team:

In [ ]:
groups.mean()

### Handling Missing Values

Many real datasets have missing values, either because it exists and was not collected or it never existed. When we load the dataset titanic.csv dataset, we see that some columns have many missing values - i.e. they contain the null/empty value *NaN*.

In [ ]:
df = pd.read_csv("../data/titanic.csv")

In [ ]:
df.shape

In [ ]:
df.isnull().sum()

One option is to simply drop a feature with many missing values. So we could drop the "Age" column using the *drop()* function:

In [ ]:
df.drop(["Age"], axis=1)

However, if we expect age to play an important role, then we want to keep the column and estimate the missing values in some way.
A simple approach is to fill in missing values using the mean value.

In [ ]:
mean_age = df["Age"].mean()
mean_age

In [ ]:
# Replace all NaN values in the Age column with the mean value
df["Age"] = df["Age"].fillna(mean_age)
df

Confirm that the "Age" column no longer has any missing values:

In [ ]:
df.isnull().sum()